/* Initial login prompt for username and password */
"Login {0} with username and password" = "Conectar {0} com usuário e senha";

/* Lookup of password in Keychain */
"No login credentials could be found in the Keychain" = "Não foi possível encontrar credenciais válidas de acesso nas Chaves";
"The use of the Keychain is disabled in the Preferences" = "O uso das chaves está desativado nas preferências";

/* Password proctected private key for SSH public key authentication */
"Invalid passphrase" = "Frase de senha inválida";
"Private key password protected" = "Chave Privada protegida por senha";
"Enter the passphrase for the private key file" = "Insira a frase de senha para acessar o arquivo de chaves privadas";

"Login canceled" = "Conexão cancelada";
"Login failed" = "A conexão falhou";
"Login successful" = "Conexão bem sucedida";

/* Private key selection for SSH public key authentication */
"Select the private key in PEM or PuTTY format" = "Selecione a chave privada no formato PEM/PuTTY";

/* Challenge-Respone authentication */
"Partial authentication success" = "Autenticação parcial bem sucedida";
"Provide additional login credentials" = "Informe as credenciais adicionais de conexão";

/* Login prompt placeholders */
"Username" = "Usuário";
"Password" = "Senha";

/* Warning when credentials are sent using unsecured protocol. Unsecure FTP connection */
"Unsecured {0} connection" = "Conexão {0} não segura";

/* Credentials sent over plaintext connection */
"{0} will be sent in plaintext." = "{0} será enviado em texto puro.";
"Don't show again" = "Não mostrar novamente";
"Continue" = "Continuar";
"Disconnect" = "Desconectar";

/* Protocol switch proposal */
"The server supports encrypted connections. Do you want to switch to {0}?" = "O servidor suporta conexões criptografadas. Você deseja alternar para {0}?";
"Change" = "Alterar";
/* OAuth2 */
"Paste the authentication code from your web browser" = "Colar o código de autenticação de seu navegador";
"Open web browser to authenticate and obtain an authorization code" = "Open web browser to authenticate and obtain an authorization code";
